In [5]:
import numpy as np
import pandas as pd

In [3]:
A = np.random.randint(20, size=(5,4))

In [4]:
A

array([[12, 19,  3, 16],
       [ 0, 12,  0,  7],
       [13, 19,  5, 14],
       [16,  2,  7,  9],
       [15, 13, 16, 12]])

In [6]:
df = pd.DataFrame(A)
df

    0   1   2   3
0  12  19   3  16
1   0  12   0   7
2  13  19   5  14
3  16   2   7   9
4  15  13  16  12

In [7]:
df.isnull().sum()

0    0
1    0
2    0
3    0
dtype: int64

In [9]:
df.dropna(axis=0)

    0   1   2   3
0  12  19   3  16
1   0  12   0   7
2  13  19   5  14
3  16   2   7   9
4  15  13  16  12

In [10]:
df.dropna(axis=1)

    0   1   2   3
0  12  19   3  16
1   0  12   0   7
2  13  19   5  14
3  16   2   7   9
4  15  13  16  12